source/doc/eds-数据统计.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>eds-数据统计</title>
<!-- 2015-10-08 四 14:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="世凡 黄" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">eds-数据统计</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 选用技术</a>
<ul>
<li><a href="#sec-1-1">1.1. 访问层</a></li>
<li><a href="#sec-1-2">1.2. 持久层: mongodb</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 优势</a></li>
<li><a href="#sec-1-2-2">1.2.2. Getting Started Guide</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 访问日志</a>
<ul>
<li><a href="#sec-2-1">2.1. 叙述</a></li>
<li><a href="#sec-2-2">2.2. 实现方法</a></li>
<li><a href="#sec-2-3">2.3. 记录数据</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 权限访问记录</a></li>
<li><a href="#sec-4">4. 数据可视化</a></li>
<li><a href="#sec-5">5. 扩充</a>
<ul>
<li><a href="#sec-5-1">5.1. 可配置性</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 选用技术</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 访问层</h3>
<div class="outline-text-3" id="text-1-1">
<p>
采用appkey和appsecret的方式校验请求合法性。参考eds会员商城或者消息系统
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 持久层: mongodb</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 优势</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>快速!(当然，这和具体的应用方式有关，通常来说，它比一般的关系型数据库快5位左右。)很高的可扩展性 – 轻轻松松就可实现PB级的存储(但是可能我们并不需要PB级的存储，10TB可能就够了)
</li>
<li>它有一个很好的 replication 模式 (replica sets)
</li>
<li>有很完善的Java API
</li>
<li>它的存储格式是Json的，这对Java来说非常好处理，对javascirpt亦然。
</li>
<li>它有一个非常活跃的社区
</li>
<li>扩展性高
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Getting Started Guide</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>mongodb website: <a href="https://www.mongodb.org/">https://www.mongodb.org/</a>
</li>
<li>安装: <a href="https://docs.mongodb.org/manual/installation/">https://docs.mongodb.org/manual/installation/</a>
</li>
<li>CRUD概念: <a href="https://docs.mongodb.org/manual/core/crud/">https://docs.mongodb.org/manual/core/crud/</a>
</li>
<li>传统关系型数据库跟mongodb的使用对比:<a href="https://docs.mongodb.org/manual/reference/sql-comparison/">https://docs.mongodb.org/manual/reference/sql-comparison/</a>
</li>
<li>java版本操作库: <a href="https://docs.mongodb.org/getting-started/java/">https://docs.mongodb.org/getting-started/java/</a>
</li>
</ol>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 访问日志</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 叙述</h3>
<div class="outline-text-3" id="text-2-1">
<p>
记录所有访问记录。
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 实现方法</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>提供api接口方式(基于http协议和json数据)
</li>
<li>网页可提供javascript文件形式，参照百度统计(页面嵌套script标签请求后台，后台解析该请求头实现统计)。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 记录数据</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<b>*</b> 数据范例(取于<a href="https://www.nginx.com/resources/admin-guide/logging-and-monitoring/">nginx 访问日志</a>)
</p>
<ul class="org-ul">
<li>格式
'$remote_addr - $remote_user [$time_local] "$request" $status $body_bytes_sent "$http_referer" "$http_user_agent"  
</li>
<li>例子
127.0.0.1 - - [05/Oct/2015:00:00:58 +0800] "GET /index.php HTTP/1.1" 200 91632 "-" "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36"
</li>
</ul>

<p>
说明:
</p>
<ul class="org-ul">
<li>$remote_addr - client address
</li>
<li>$remote_user - user name supplied with the Basic authentication
</li>
<li>$time_local - local time in the Common Log Format (1.3.12, 1.2.7)
</li>
<li>$request - full original request line
</li>
<li>$status - response status (1.3.2, 1.2.2)
</li>
<li>$body_bytes_sent - number of bytes sent to a client, not counting the response header; this variable is compatible with the “%B”
</li>
<li>$http_referer - http header "Referer"
</li>
<li>$http_user_agent - http header "User-Agent"
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 权限访问记录</h2>
<div class="outline-text-2" id="text-3">
<p>
待定
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 数据可视化</h2>
<div class="outline-text-2" id="text-4">
<p>
待定，可参照<a href="http://demo.nginx.com/status.html?_ga=1.63700711.959568803.1442589773">nginx plus - live load balancing status</a>。吞出量，请求量，指定ip浏览统计。
</p>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 扩充</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 可配置性</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>通过配置文件方式实现统计记录可配置化
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 世凡 黄</p>
<p class="date">Created: 2015-10-08 四 14:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
